using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace myClinic
{
    class C_String
    {
        public static string msgtext(int flag)
        {
            string ms = "";
            if(flag == 1)
            {
                ms = "تمام مقادیر را پر کنید";
            }
            else if (flag == 2)
            {
                ms = "داده ای تغییر نکرده است";
            }
            else if (flag == 3)
            {
                ms = "ویرایش انجام شد";
            }
            else if (flag == 4)
            {
                ms = "لطفا مقداری را وارد کنید";
            }
            else if(flag == 5)
            {
                ms = "شما تمایل به پاک کردن ";
            }
            else if(flag == 6)
            {
                ms = "سطر را دارید ،آیا مطمئن هستین !!!";
            }
            else if(flag == 7)
            {
                ms = "اخطار";
            }
            else if (flag == 8)
            {
                ms = "شما هیچ سطری انتخاب نکرده اید";
            }
            else if (flag == 9)
            {
                ms = " برای این بیمار وقت دکتر تعیین شده است در صورت تمایل به حذف باید اول وقت آن را حذف کنید و سپس اقدام به حذف کنید در غیر این صورت برنامه را "+"refresh "+"کنید";
            }
            else if (flag == 10)
            {
                ms = "شماره پرونده تکراریست";
            }
            else if(flag == 11)
            {
                ms = "کد ملی تکراریست،شخص دیگری با این کد ملی در سیستم ثبت شده است";
            }
            else if (flag == 12)
            {
                ms = "تعداد شماره ملی باید 10 باشد";
            }
            else if (flag == 13)
            {
                ms = "امکان حذف وجود ندارد بیمارانی با این دکتر وقت کرفته اند لطفا اول وقت ملاقات انها را حذف کنید و سپس اقدام به حذف دکتر کنید!!";
            }else if (flag == 14)
            {
                ms = "نام کاربری یا رمز عبور اشتباه است";
            }else if(flag == 15)
            {
                ms = " لطفا عکس را انتخاب کنید در صورت انتخاب نکردن عکس عکس پیش فرض ذخیره میشود";
            }else if(flag == 16)
            {
                ms = "برای دیافت گزارش دیگر لطفا یک بار صفحه قبل برگردید و دباره صفحه گزارش را باز کنید";
            }else if(flag == 17)
            {
                ms = "این بیمار در این تاریخ با این پزشک وقت ملاقات گرفته است و دیگر نمیتواند با این پزشک در این تاریخ وقت بگیرد";
            }else if(flag == 18)
            {
                ms = "این پزشک در این زمان با (آقا / خانم) ";
            }else if(flag == 19)
            {
                ms = "وقت ملاقات دارد";
            }else if(flag==20)
            {
                ms = "شناسه وقت ویزیت برابر است با کد ";
            }else if(flag==21)
            {
                ms = "لطفا فرم را یک بار ببندین و دباره فایل اکسل را وارد کنید در صورت بروز دباره خطا مشکل از فایل اکسل است لطفا فایل اکسل را بررسی کنید دز صورت لزوم با پشتیبانی تماس برقرار کنید ";
            }else if(flag==22)
            {
                ms = " لیست بیماران با موفقییت در دیتابیس ذخیره شد ";
            }else if(flag == 23)
            {
                ms = " عملیات انجام نشد ";
            }else if(flag == 24)
            {
                ms = "فرمت ساعت اشتباست";
            }else if(flag==25)
            {
                ms = "لطفا تاریخ را وارد کنید";
            }else if(flag == 26)
            {
                ms = "پزشک محترم رمز عبور شما به کد نظام پزشکی شما تغییر کرد";
            }
            
            return ms;
        }
    }
}
